// +----------------------------------------------------------------------
// | 黔序商城 [ 黔序科技，助力企业发展 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2021~2026 https://www.qianxutec.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 黔序商城系统软件V1.0（软著登记号2025SR2146980），未经许可不得去除版权声明
// +----------------------------------------------------------------------
// | Author: 贵州黔序科技有限公司
// +----------------------------------------------------------------------

module.exports = {
	/*
	-----仅在APP生效-----
	slide-in-right 新窗体从右侧进入
	slide-in-left  新窗体从左侧进入
	slide-in-top   新窗体从顶部进入
	slide-in-bottom	新窗体从底部进入
	pop-in  新窗体从左侧进入，且老窗体被挤压而出
	fade-in 新窗体从透明到不透明逐渐显示
	zoom-out 新窗体从小到大缩放显示
	zoom-fade-out	新窗体从小到大逐渐放大并且从透明到不透明逐渐显示
	none 无动画
	*/
	type:'zoom-fade-out',
	duration:200
}